MPLS Working Group                                      Sandeep Bishnoi 
Internet Draft                                      Pranjal Kumar Dutta 
Intended status: Standards Track                          Alcatel-Lucent 
Expires: April 2010                                    
 
                                                       October 19, 2009 
                                    
                          LDP Node and FEC group 


                 draft-bishnoi-mpls-ldp-node-group-00.txt 


Status of this Memo 

   This Internet-Draft is submitted to IETF in full conformance with the 
   provisions of BCP 78 and BCP 79.  

   Internet-Drafts are working documents of the Internet Engineering 
   Task Force (IETF), its areas, and its working groups.  Note that 
   other groups may also distribute working documents as Internet-
   Drafts. 

   Internet-Drafts are draft documents valid for a maximum of six months 
   and may be updated, replaced, or obsoleted by other documents at any 
   time.  It is inappropriate to use Internet-Drafts as reference 
   material or to cite them other than as "work in progress." 

   The list of current Internet-Drafts can be accessed at 
   http://www.ietf.org/ietf/1id-abstracts.txt 

   The list of Internet-Draft Shadow Directories can be accessed at 
   http://www.ietf.org/shadow.html 

   This Internet-Draft will expire on April 19, 2010. 

Copyright Notice 

   Copyright (c) 2009 IETF Trust and the persons identified as the 
   document authors. All rights reserved. 

   This document is subject to BCP 78 and the IETF Trust's Legal 
   Provisions Relating to IETF Documents 
   (http://trustee.ietf.org/license-info) in effect on the date of 
   publication of this document. Please review these documents 
   carefully, as they describe your rights and restrictions with 
   respect to this document. Code Components extracted from this 
   document must include Simplified BSD License text as described in 
    
 
 

Bishnoi, et. al         Expires April 19, 2010                 [Page 1] 

Internet-Draft          LDP Node and FEC Group             October 2009 
    

   Section 4.e of the Trust Legal Provisions and are provided without 
   warranty as described in the BSD License. 

Abstract 

   [RFC5036] and [MLDP] describes the Label Distribution Protocol (LDP) 
   for setup of point-to-point (P2P), point to multi-point (P2MP) and 
   multipoint-to-multipoint (MP2MP) Label Switched Paths (LSPs). 
   Upstream node selection for P2MP/MP2MP LSP and label map propagation 
   for P2P is based on route availability and local policy. If multiple 
   paths are available then there is no method for selection of certain 
   preferred nodes. A new method is defined in this document that can 
   optionally be used as a tiebreaker among multiple available paths in 
   upstream node selection. This method provides a mechanism to guide 
   traffic via specific set of nodes in a network. 

Table of Contents 

    
   1. Introduction...................................................2 
   2. Terminology....................................................3 
   3. Conventions used in this document..............................3 
   4. Structure for LDP Node group mapping and FEC group advertisement3 
      4.1. Node group advertisement..................................3 
      4.2. FEC group mapping.........................................4 
   5. Limitations....................................................5 
   6. Security Considerations........................................5 
   7. IANA Considerations............................................5 
   8. References.....................................................5 
      8.1. Normative References......................................5 
   9. Acknowledgments................................................6 
    
1. Introduction 

   LDP downstream node selection for P2P LSP and upstream node selection 
   for P2MP/MP2MP LSP is based on route availability at each node. If 
   multiple such paths are available then node resolving LDP FEC based 
   on route is based on local policy.  

   In case of availability of multiple paths, there is no mechanism to 
   direct traffic towards preferred nodes or restrict traffic to flow 
   via nodes that are not preferred. Few applications that use LDP LSP 
   also require redundant paths for minimum downtime of service. One of 
   the requirements for such applications is to establish LSP via 
   disjoint nodes. 


 
 
Bishnoi, et. al         Expires April 19, 2010                 [Page 2] 

Internet-Draft          LDP Node and FEC Group             October 2009 
    

   This proposal defines a method to identify and select a preferred 
   node group to setup LSP. Scheme defined in this document also allows 
   restricting traffic flow within a certain set of nodes and also 
   avoiding nodes that belong to a group that is not preferred. This 
   proposal is only for preferred node selection and does not address 
   selection or avoiding preferred links. 

   This document defines a node level attribute to identify selection 
   group and a mechanism to advertise and propagate an LDP FEC with 
   group attribute. This scheme may be applied to P2P and P2MP/MP2MP 
   LSP. This method can be applied to P2P LSP during decision process to 
   send label map to a peer. For P2MP/MP2MP LSP, this method is applied 
   during upstream node selection. 

   This document defines two new LDP parameters: 

     . Node group 

     . FEC group mapping  

2. Terminology  

   This document uses the terminology defined in [RFC5036] and [MLDP]. 

3. Conventions used in this document 

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT", 
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this 
   document are to be interpreted as described in [RFC-2119]. 

4. LDP node and FEC group 

   Group mapping of a node may be advertised to a peer using "Node Group 
   Capability" message. Group mapping per FEC may be advertised to a 
   peer using "FEC Group TLV" in Label Map message.   

4.1. Node Group Capability 

   An LSR may advertise node group map capability to an LDP peer using 
   method defined in [RFC5561]. Node group message must be silently 
   discarded if the receiving node does not support it. 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |1|0|   Node Group Capability   |     Length                    | 
 
 
Bishnoi, et. al         Expires April 19, 2010                 [Page 3] 

Internet-Draft          LDP Node and FEC Group             October 2009 
    

     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-| 
     |                         Node Group Map                        | 
     |-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
    

   Type: Node Group Capability (TBD) 

   Node Group Map: A 32-bit node group map. 

4.2. FEC Group TLV 

   FEC group mapping TLV may be included in Label Map message to 
   advertise node group to be used for upstream node selection. FEC 
   group mapping must be silently discarded if the receiving node does 
   not support it. 

      0                   1                   2                   3 
      0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |1|0|  FEC Group Mapping        |     Length                    | 
     +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-| 
     |                         Include Group                         | 
     |-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |                         Exclude Group                         | 
     |-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
     |I|E|   Reserved                | 
     |-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+ 
 
    

   Type: FEC Group Mapping (TBD) 

   Include Group: 32-bit map of node groups to include while propagating 
   label map 

   Exclude Group: 32-bit map of node groups to exclude while propagating 
   label map 

   Include Type (I): Strict (1) or Loose (0) 

   Exclude Type (E): Strict (1) or Loose (0) 

   A node processing P2P LSP label map message propagates it further to 
   upstream node based on criteria defined in [RFC5036]. A node 

 
 
Bishnoi, et. al         Expires April 19, 2010                 [Page 4] 

Internet-Draft          LDP Node and FEC Group             October 2009 
    

   processing P2MP/MP2MP LSP label map message selects a single upstream 
   node based on criteria defined in [MLDP].  

   If a FEC group mapping is included in label map message then the 
   receiving node may choose sending the label map message further to 
   its peers based on group mapping received in label map. FEC group 
   mapping must then match peer node group advertisement to qualify to 
   receive a label map.  

   For P2P LSP, if include type is "Strict" then the label map message 
   MUST only be propagated to peers that have all the groups. If exclude 
   type is "Strict" then the label map message MUST not be propagated to 
   peers that have any of the groups. 

   For P2MP/MP2MP LSP, if include type is "Strict" then the label map 
   message MUST only be propagated to a peer that has all the groups. If 
   exclude type is "Strict" then the label map message MUST not be 
   propagated to a peer that has any of the groups. 

   If multiple peers qualify then include and exclude type must be used 
   as a tiebreaker. "Strict" is preferred over "Loose" group map. 

        
5. Limitations 

   This scheme does not guarantee setup of LSP if "Strict" group option 
   for an LDP FEC is enabled. This scheme requires proper network 
   provisioning for it to work. 

6. Security Considerations 

   The same security considerations apply as for the base LDP 
   specification, as described in [RFC5036] and MP LDP specification, as 
   described in [MLDP]. 

7. IANA Considerations 

   This document requires allocation of Node Group Capability and FEC 
   Group TLV. 

8. References 

8.1. Normative References 

   [MLDP]    I. Minei, K., Kompella, I. Wijnands, B. Thomas, "Label      
             Distribution Protocol Extensions for Point-to-Multipoint  

 
 
Bishnoi, et. al         Expires April 19, 2010                 [Page 5] 

Internet-Draft          LDP Node and FEC Group             October 2009 
    

             and Multipoint-to-Multipoint Label Switched Paths",  
             draft-ietf-mpls-ldp-p2mp-06.txt, May 2008 

   [RFC5036] Andersson, L., Minei, I., and B. Thomas, "LDP 
             Specification", RFC 5036, October 2007. 
 
   [RFC5561] B. Thomas, K. Raza, S. Aggarwal, R. Aggarwal,  
             JL. Le Roux, "LDP Capabilities", RFC 5561, July 2009. 
 
   [RFC2119] Bradner, S., "Key words for use in RFCs to Indicate 
             Requirement Levels", BCP 14, RFC 2119, March 1997. 

9. Acknowledgments 

   The authors would like to acknowledge the comments and suggestions 
   from Wim Henderickx. 

   This document was prepared using 2-Word-v2.0.template.dot. 

 

Authors' Addresses 

   Sandeep Bishnoi  
   Alcatel-Lucent 
   701 E Middlefield Road, 
   Mountain View, CA 94043 
   USA 
       
   Email: sandeep.bishnoi@alcatel-lucent.com 
    

   Pranjal Kumar Dutta 
   Alcatel-Lucent 
   701 E Middlefield Road, 
   Mountain View, CA 94043 
   USA    
    
   Email: pdutta@alcatel-lucent.com 
 






 
 
Bishnoi, et. al         Expires April 19, 2010                 [Page 6] 

